snlkuharlocal/src/Reports/ЗаявкаНаОтрузкуПНК/ЗаявкаНаОтрузкуПНК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗаявкаНаОтрузкуПНК</name>
  <attributes>
    <name>ДеревоОбщихНастроек</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастроекПользователя</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Распределение</name>
    <attributes>
      <name>СсылкаНаЗаявку</name>
      <type>
        <types>DocumentRef.ЗаявкаНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресОтправитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНакладной</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.ПризнакиДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Самовывоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНакладных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерХодки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доставка</name>
    <attributes>
      <name>СсылкаНаЗаявку</name>
      <type>
        <types>DocumentRef.ЗаявкаНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доставлена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортнаяКомпанияОтправитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПерегрузаОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортнаяКомпанияПолучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПерегрузаПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНакладной</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.ПризнакиДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресОтправитель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДоставки</name>
      <type>
        <types>EnumRef.ТипыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладСамовывоза</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиДляВыгрузки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

snlkuharlocal/src/Reports/ЗаявкаНаОтрузкуПНК/ObjectModule.bsl
//кухарь 12.11.14 начало
//меняем реквизит распределена из ТЧ накладные документа ЗОГ - тут
процедура ИзменитьРеквизитРаспределенаВЗОГ(Автомобиль,Значение,ДатаОтгрузки)   экспорт	
	//проверки на совсем уж кривой вызов функции начало
	если значение<>Истина и Значение<>ложь тогда
		Сообщить("Не корректное значение реквизита..обратитесь в тех поддержку.");
		Возврат;
	КонецЕсли;	
	если ТипЗнч(Автомобиль)<>Тип("СправочникСсылка.Автомобили")тогда
		Сообщить("Не корректный автомобиль..обратитесь в тех поддержку.");
		Возврат;
	КонецЕсли;
	//пока уберу чтобы тестить легче было
	//если НачалоМесяца(ТекущаяДата())>ДатаОтгрузки тогда
	//	Сообщить("Утверждать распределение маршрутов можно только в текущем месяце.");
	//	Возврат;
	//КонецЕсли;
	//проверки на совсем уж кривой вызов функции конец
	
	если Автомобиль=Справочники.Автомобили.ПустаяСсылка() тогда //тогда утверждаем маршрут для всех накладных с машинами
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
		|ГДЕ
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен
		|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
		|	И ЗаявкаНаОтгрузкуНакладные.Автомобиль <> &Автомобиль
		|	И ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ПНК""
		|	И (ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ЗТО""
		|			ИЛИ ЗаявкаНаОтгрузкуНакладные.ВидНакладной = ""ЗТО""
		|				И ЗаявкаНаОтгрузкуНакладные.Отправитель.КодФизическогоУзла = &КодФизическогоУзла)
		//кухарь 23.03.15 начало
		|	И ЗаявкаНаОтгрузкуНакладные.Отправитель.КодФизическогоУзла = &КодФизическогоУзла";	
		//кухарь 23.03.15 конец
		запрос.УстановитьПараметр("КодФизическогоУзла",ПараметрыСеанса.ЭтотУзел.Код);	
		//кухарь 15.03.15 конец
		запрос.УстановитьПараметр("ДатаОтгрузки",НачалоДня(ДатаОтгрузки));
		запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		результат=запрос.Выполнить().Выгрузить();
		для каждого СтрРез из результат цикл
			ЗОГобъект=СтрРез.ссылка.получитьобъект();
			//кухарь 22.04.15 начало
			//Для каждого Накладная из ЗОГобъект.Накладные цикл
			//	если Накладная.Автомобиль=Автомобиль тогда
			//		Накладная.Распределена=Значение;
			//	КонецЕсли;
			//КонецЦикла;	
			//ЗОГобъект.Записать();
			НадоЗаписать=ложь;
			Для каждого Накладная из ЗОГобъект.Накладные цикл
				если Накладная.Распределена<>Значение тогда
					НадоЗаписать=Истина;
				КонецЕсли;
				Накладная.Распределена=Значение;
			КонецЦикла;
			если НадоЗаписать тогда
				ЗОГобъект.Записать();
			КонецЕсли;
			//кухарь 22.04.15 конец
		КонецЦикла;	
	иначе //тогда утверждаем маршрут для текущей машины
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
		|ГДЕ
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен
		|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
		|	И ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
		|	И ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ПНК""
		|	И (ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ЗТО""
		|			ИЛИ ЗаявкаНаОтгрузкуНакладные.ВидНакладной = ""ЗТО""
		|				И ЗаявкаНаОтгрузкуНакладные.Отправитель.КодФизическогоУзла = &КодФизическогоУзла)
		//кухарь 24.03.15 начало
		|	И ЗаявкаНаОтгрузкуНакладные.Отправитель.КодФизическогоУзла = &КодФизическогоУзла";
		//кухарь 24.03.15 конец
		запрос.УстановитьПараметр("КодФизическогоУзла",ПараметрыСеанса.ЭтотУзел.Код);
		//кухарь 15.03.15 конец
		
		запрос.УстановитьПараметр("ДатаОтгрузки",НачалоДня(ДатаОтгрузки));
		запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		
		результат=запрос.Выполнить().Выгрузить();
		для каждого СтрРез из результат цикл
			ЗОГобъект=СтрРез.ссылка.получитьобъект();
			Для каждого Накладная из ЗОГобъект.Накладные цикл
				если Накладная.Автомобиль=Автомобиль тогда
					Накладная.Распределена=Значение;
				КонецЕсли;
			КонецЦикла;		
			ЗОГобъект.Записать();
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Кухарь А.Ю. 14.12.2021 начало
//Функция ПроверитьРаспределениеАвтомобиляВМаршрут (Автомобиль,ДатаОтгрузки) экспорт
Функция ПроверитьРаспределениеАвтомобиляВМаршрут (Автомобиль,ДатаОтгрузки,НомерХодки=Неопределено) экспорт
 
// Кухарь А.Ю. 14.12.2021 конец

	если ТипЗнч(Автомобиль)<>Тип("СправочникСсылка.Автомобили")тогда
		Сообщить("Не корректный автомобиль..обратитесь в тех поддержку.");
		Возврат ложь;
	КонецЕсли;
	
	//крохин начало 30.04.2015
	Если Автомобиль.пустая() Тогда
	Возврат Ложь;	
	КонецЕсли;
	
	//крохин конец 30.04.2015
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаОтгрузкуНакладные.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	|ГДЕ
	|	ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен
	|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	|	И ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
	|	И ЗаявкаНаОтгрузкуНакладные.Распределена";
	запрос.УстановитьПараметр("ДатаОтгрузки",НачалоДня(ДатаОтгрузки));
	запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	// Кухарь А.Ю. 14.12.2021 начало
	//
	если НомерХодки<>Неопределено тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"И ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль","И ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль и ЗаявкаНаОтгрузкуНакладные.НомерХодки = &НомерХодки ");
		запрос.УстановитьПараметр("НомерХодки",НомерХодки);
	КонецЕсли;
	// Кухарь А.Ю. 14.12.2021 конец
	
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		возврат Истина;
	иначе
		Возврат ложь;
	КонецЕсли;
	
КонецФункции

//кухарь 12.11.14 конец

Функция ТабличныйДокументЗаполнен(ТабДокумент) Экспорт
	Если ТабДокумент.Области.Количество()> 0  Тогда
		Возврат Истина;
	Иначе
		Сообщить("Табличный документ пустой");
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция СоздатьЗаявкиНаДоставку(СтруктураДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтгрузки", СтруктураДокумента.ДатаОтгрузки);
	
	СписокНедопустимыхСостояний = Новый СписокЗначений;
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.Отменена);
	Запрос.УстановитьПараметр("СписокНедопустимыхСостояний",СписокНедопустимыхСостояний);
	
	Запрос.УстановитьПараметр("КодФизическогоУзла", ПараметрыСеанса.ЭтотУзел.Код);
	
	ТекстАвтомобиль = "";
	Если СтруктураДокумента.Свойство("Автомобиль") Тогда
		Если ТипЗнч(СтруктураДокумента.Автомобиль) = Тип("СправочникСсылка.Автомобили") И ЗначениеЗаполнено(СтруктураДокумента.Автомобиль) Тогда
			ТекстАвтомобиль = "И Накладные.Автомобиль = &Автомобиль";
			Запрос.УстановитьПараметр("Автомобиль", СтруктураДокумента.Автомобиль);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Накладные.Автомобиль КАК Автомобиль,
	|	Накладные.НомерХодки КАК НомерХодки,
	|	Накладные.ПорядковыйНомерОтгрузки КАК ПорядковыйНомерОтгрузки,
	|	Накладные.Накладная КАК Накладная,
	|	Накладные.Получатель КАК Получатель,
	|	Накладные.ПунктДоставкиПолучатель КАК ПунктДоставки,
	|	ВЫБОР
	|		КОГДА Накладные.ВидНакладной = ""ПНК""
	|			ТОГДА Накладные.АдресОтправитель
	|		КОГДА Накладные.ВидНакладной = ""ЗТО""
	|				И (Накладные.Отправитель ССЫЛКА Справочник.Контрагенты
	|					ИЛИ Накладные.Отправитель.КодФизическогоУзла <> ""OD7"")
	|			ТОГДА Накладные.АдресОтправитель
	|		ИНАЧЕ Накладные.АдресПолучатель
	|	КОНЕЦ КАК АдресПолучателя,
	|	Накладные.ДатаПриемки КАК ДатаПриемки,
	|	Накладные.ВремяПриемки КАК ВремяПриемки,
	|	Накладные.Количество КАК КоличествоНакладной,
	|	Накладные.СуммаДокумента КАК СуммаНакладной,
	|	Накладные.Объем КАК ОбъёмНакладной,
	|	Накладные.ВидНакладной КАК ВидНакладной
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку.Накладные КАК Накладные
	|ГДЕ
	|	Накладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	|	" + ТекстАвтомобиль + "
	|	И Накладные.ВидНакладной <> ""ПНК""
	|	И (Накладные.ВидНакладной <> ""ЗТО""
	|			ИЛИ Накладные.ВидНакладной = ""ЗТО""
	|				И Накладные.Отправитель.КодФизическогоУзла = &КодФизическогоУзла)
	|	И НЕ Накладные.НеОтгружать
	|	И НЕ ЕСТЬNULL(Накладные.Накладная.СостояниеНакладной, Накладные.СостояниеНакладной) В (&СписокНедопустимыхСостояний)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Автомобиль,
	|	НомерХодки,
	|	ПорядковыйНомерОтгрузки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗОГ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗОГ.Количество() = 0 Тогда Возврат Ложь; КонецЕсли;
	
	МассивАвтомобилей = РезультатЗОГ.ВыгрузитьКолонку("Автомобиль");
	МассивАвтомобилей = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(МассивАвтомобилей);
	
	Для Каждого СтрАвтомобиль из МассивАвтомобилей Цикл
		
		МассивСтрокТЗ = РезультатЗОГ.НайтиСтроки(Новый Структура("Автомобиль", СтрАвтомобиль));
		
		МассивНомеровХодок = Новый Массив;
		Для Каждого СтрокаТЗ ИЗ МассивСтрокТЗ Цикл
			Индекс = МассивНомеровХодок.Найти(СтрокаТЗ.НомерХодки);
			Если Индекс = Неопределено Тогда
				МассивНомеровХодок.Добавить(СтрокаТЗ.НомерХодки);
			КонецЕсли;
		КонецЦикла;
		
		МассивНомеровХодок = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(МассивНомеровХодок);
		
		Для Каждого НомерХодки ИЗ МассивНомеровХодок Цикл
			
			ЗапросДок = Новый Запрос;
			ЗапросДок.УстановитьПараметр("Автомобиль", СтрАвтомобиль);
			ЗапросДок.УстановитьПараметр("НомерХодки", НомерХодки);
			ЗапросДок.УстановитьПараметр("НачалоПериода", НачалоДня(СтруктураДокумента.ДатаОтгрузки));
			ЗапросДок.УстановитьПараметр("КонецПериода", КонецДня(СтруктураДокумента.ДатаОтгрузки));

			ЗапросДок.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаявкаНаДоставку.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
			|ГДЕ
			|	ЗаявкаНаДоставку.Проведен
			|	И ЗаявкаНаДоставку.ДатаОтгрузки МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ЗаявкаНаДоставку.Автомобиль = &Автомобиль
			|	И ЗаявкаНаДоставку.НомерХодки = &НомерХодки";
			
			УстановитьПривилегированныйРежим(Истина);
			Результат = ЗапросДок.Выполнить().Выгрузить();
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Результат.Количество() > 0 Тогда
				ЗаявкаНаДоставкуОбъект = Результат[0].Ссылка.ПолучитьОбъект();
			Иначе
				ЗаявкаНаДоставкуОбъект = Документы.ЗаявкаНаДоставку.СоздатьДокумент();
				ЗаявкаНаДоставкуОбъект.Дата = СтруктураДокумента.ДатаОтгрузки;
			КонецЕсли;
			
			Если ЗаявкаНаДоставкуОбъект <> Неопределено Тогда
				
				СтруктураДокумента.Вставить("Автомобиль", СтрАвтомобиль);
				СтруктураДокумента.Вставить("НомерХодки", НомерХодки);
				
				МассивСтрокХодки = РезультатЗОГ.НайтиСтроки(Новый Структура("Автомобиль, НомерХодки", СтрАвтомобиль, НомерХодки));  // Нужный набор строк по Автомобилю и Номеру ходки
				Если МассивСтрокХодки.Количество() > 0 Тогда
					СтруктураДокумента.Вставить("Накладные", МассивСтрокХодки);	
				КонецЕсли;
				
				ЗаявкаНаДоставкуОбъект.Заполнить(СтруктураДокумента);
				
				Попытка
					ЗаявкаНаДоставкуОбъект.Записать(РежимЗаписиДокумента.Проведение);
					СообщитьИзМодуля("Создан/изменен документ " + Строка(ЗаявкаНаДоставкуОбъект.Ссылка));
				Исключение
					СообщитьИзМодуля(ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции
